12/data/attachments/6c8634c37e58b7e9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_408bef4b-ea0f-4869-9202-5823b89f5637</nif:username>
            <nif:friendToBeAdded>Adam_stuff_Friend_1169_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>